/**
 * Вдохновленные командой разработчиков из Vooza, напишите функцию,
 * которая принимает имя программиста и возвращает количество световых мечей,
 * принадлежащих этому человеку.
 *
 * Единственный человек, владеющий световыми мечами, - Зак, кстати.
 * Он владеет 18 световыми мечами, что является потрясающим количеством световых мечей.
 * Все остальные владеют 0. Примечание: ваша функция должна иметь параметр по умолчанию.
 */

const howManyLightsabersDoYouOwn = (name) =>name=== 'Zach' ? 18 : 0
